<template>
    <div class="home">
        <ve-line :data="chartData"></ve-line>
    </div>
</template>

<script>
export default {
    // 页面切换动画
    transition:"transleft",
    components:{
        
    },
    data(){
        return{
            chartData: {
            columns: ['日期', '访问用户', '下单用户', '下单率'],
            rows: [
                { '日期': '1', '访问用户': 1393, '下单用户': 1093, '下单率': 132 },
                { '日期': '2', '访问用户': 3530, '下单用户': 3230, '下单率': 226 },
                { '日期': '3', '访问用户': 2923, '下单用户': 2623, '下单率': 776 },
                { '日期': '4', '访问用户': 1723, '下单用户': 1423, '下单率': 449 },
                { '日期': '5', '访问用户': 3792, '下单用户': 3492, '下单率': 3323 },
                { '日期': '6', '访问用户': 4593, '下单用户': 4293, '下单率': 778 },
                { '日期': '7', '访问用户': 1723, '下单用户': 1423, '下单率': 449 },
                { '日期': '8', '访问用户': 3792, '下单用户': 3492, '下单率': 3323 },
                { '日期': '9', '访问用户': 4593, '下单用户': 4293, '下单率': 778 }
            ]
            }
        }
    },
    methods:{

    },
    mounted(){
    }
}
</script>
<style lang="stylus" scoped>
.home
 background #ffffff
 padding 1%
 min-height 800px
</style>
